/***************************************************************************//**
  @file     App.c
  @brief    Application functions
  @author   Nicolás Magliola
 ******************************************************************************/

/*******************************************************************************
 * INCLUDE HEADER FILES
 ******************************************************************************/
#include "header/board.h"
#include "stdbool.h"
#include <stdio.h>
#include "header/timer.h"
#include "header/Button.h"
#include "header/timer.h"
#include "header/SPI.h"
#include "header/PISO.h"
/*******************************************************************************
 * CONSTANT AND MACRO DEFINITIONS USING #DEFINE
 ******************************************************************************/


/*******************************************************************************
 * FUNCTION PROTOTYPES FOR PRIVATE FUNCTIONS WITH FILE LEVEL SCOPE
 ******************************************************************************/


/*******************************************************************************
 *******************************************************************************
                        GLOBAL FUNCTION DEFINITIONS
 *******************************************************************************
 *******************************************************************************
 ******************************************************************************/


/*******************************************************************************
 * INTERRUPCIONES
 ******************************************************************************/




/*******************************************************************************
 * BALIZA
 ******************************************************************************/
static uint8_t source[1] = {0b10000001};//,20,20,20,10,10,10,10};
static uint8_t debug = 1;
static uint8_t destination[1];


void App_Init (void)
{
	spi_init();
}

/* Función que se llama constantemente en un ciclo infinito */
static int a;
void App_Run (void)
{
	if(debug){
		spi_transaction(source, sizeof(source), destination);
		if(destination[0] & 16){ //left
			a = 1;
		}
		if(destination[0] & 32){ //down
			a = 2;
		}
		if(destination[0] & 64){ //right
			a = 3;
		}
		if(destination[0] & 128){ //rotate
			a = 4;
		}
		spi_transaction(source, sizeof(source), destination);
	}
}
